{
  "key": "adobe-commerce",
  "platform": "Adobe Commerce",
  "banner": "../../images/platforms/banner-adobe-commerce.png",
  "tagline": "Adobe Commerce (formerly Magento) is a flexible, scalable platform that can grow as your business grows. We offer a wide range of powerful features to help you succeed online. Adobe Commerce uses AI and advanced data exchange capabilities to create end-to-end personalized B2C and B2B commerce experiences on a single  flexible, extensible, and scalable platform. Adobe Commerce is an all-in-one platform for building and maintaining the branding needs of any e-commerce business. Ideally, it offers dynamic features that can enhance your brand even further. With Adobe Commerce software, you can create a website that is uniquely customized to your business needs, increase sales, and convert customers faster. ",
  "about": "Adobe Commerce (formerly Magento) is a flexible, scalable platform that can grow as your business grows. We offer a wide range of powerful features to help you succeed online. Adobe Commerce uses AI and advanced data exchange capabilities to create end-to-end personalized B2C and B2B commerce experiences on a single  flexible, extensible, and scalable platform. Adobe Commerce is an all-in-one platform for building and maintaining the branding needs of any e-commerce business. Ideally, it offers dynamic features that can enhance your brand even further. With Adobe Commerce software, you can create a website that is uniquely customized to your business needs, increase sales, and convert customers faster. ",
  "why": "This is a placeholder for description about why to use Adobe Commerce.",
  "features": [
    {
      "title": "Flexible Architecture for Seamless Scalability",
      "description": "Adobe Commerce's cloud-native architecture and support for modern technologies such as GraphQL and PWA (Progressive Web Apps) empower developers to build high-performing and scalable e-commerce websites."
    },
    {
      "title": "Personalization and Customer Experience",
      "description": "Adobe Commerce integrates seamlessly with Adobe Experience Manager (AEM) and Adobe Target, allowing you to leverage powerful content management and personalization tools to create unique and tailored experiences for your customers."
    },
    {
      "title": "Extensibility and Customization",
      "description": "Adobe Commerce's extensive API library, including REST and GraphQL APIs, enables seamless integration with third-party systems, such as ERP (Enterprise Resource Planning) or CRM (Customer Relationship Management), and facilitates the development of custom functionalities."
    },
    {
      "title": "Robust Commerce Features and Management Tools",
      "description": "Adobe Commerce's back-end administration interface, powered by Adobe Commerce Manager, provides an intuitive user experience for managing products, orders, and customer data. The platform also offers built-in analytics and reporting capabilities to gain insights into sales performance, customer behavior, and overall business operations."
    }
  ],
  "arch_description": "This is a placeholder of Spryker Architecture description.",
  "arch_image": "../../images/platforms/arch-adobe-commerce.png",
  "benefits": [
    {
      "title": "benefit - 1",
      "description": "This is a placeholder of Adobe Commerce benefit 1."
    },
    {
      "title": "benefit - 2",
      "description": "This is a placeholder of Adobe Commerce benefit 2."
    },
    {
      "title": "benefit - 3",
      "description": "This is a placeholder of Adobe Commerce benefit 3."
    },
    {
      "title": "benefit - 4",
      "description": "This is a placeholder of Adobe Commerce benefit 4."
    }
  ],
  "why_me": [
    {
      "title": "reason - 1",
      "description": "Reson 1 why me."
    },
    {
      "title": "reason - 2",
      "description": "Reson 2 why me."
    },
    {
      "title": "reason - 3",
      "description": "Reson 3 why me."
    },
    {
      "title": "reason - 4",
      "description": "Reson 4 why me."
    }
  ]
}