{
  "key": "commercetools",
  "platform": "CommerceTools",
  "banner": "../../images/platforms/banner-commerectools.png",
  "tagline": "Commercetools is a cloud-based e-commerce platform that provides a flexible commerce API at its core. It supports modern microservices-based architectures and offers a wide range of integrations. Commercetools is the answer to the most common problems in e-commerce today. First, an API-first approach creates microservices, services, and integrations with third-party solutions, making solutions scalable, easier to maintain, and less costly. Second, you can use commercetools to add e-commerce capabilities to your microservices-based landscape. Finally, commercetools creates innovative commerce experiences that drive traffic to your digital touchpoints and deliver great shopping experiences that can increase customer satisfaction and loyalty. ",
  "about": "Commercetools is a cloud-based e-commerce platform that provides a flexible commerce API at its core. It supports modern microservices-based architectures and offers a wide range of integrations. Commercetools is the answer to the most common problems in e-commerce today. First, an API-first approach creates microservices, services, and integrations with third-party solutions, making solutions scalable, easier to maintain, and less costly. Second, you can use commercetools to add e-commerce capabilities to your microservices-based landscape. Finally, commercetools creates innovative commerce experiences that drive traffic to your digital touchpoints and deliver great shopping experiences that can increase customer satisfaction and loyalty. ",
  "why": "This is a placeholder for description about why to use CommerceTools.",
  "features": [
    {
      "title": "Headless Commerce for Flexibility and Innovation",
      "description": "CommerceTools provides robust APIs that facilitate seamless integration with any front-end system, including web, mobile, IoT devices, voice assistants, and more. This headless architecture allows for rapid development and deployment of custom front-end experiences, ensuring a dynamic and adaptable e-commerce ecosystem."
    },
    {
      "title": "Agile Development and Scalability with Microservices",
      "description": "CommerceTools' microservices architecture enables businesses to add or remove services as needed, ensuring flexibility and modularity. The platform leverages containerization technologies like Docker and orchestration tools like Kubernetes for efficient management and deployment of microservices, enhancing scalability and performance."
    },
    {
      "title": "Cloud-Native Architecture for Efficiency and Scalability",
      "description": "CommerceTools provides a comprehensive set of RESTful APIs, enabling businesses to connect and interact with the platform's services effortlessly. The cloud-native architecture allows businesses to leverage the scalability and reliability of cloud providers, such as AWS or Google Cloud Platform, while benefiting from features like auto-scaling, load balancing, and high availability."
    },
    {
      "title": "Highly Extensible Platform for Tailored Solutions",
      "description": "CommerceTools provides a robust set of SDKs (Software Development Kits), libraries, and documentation that enable developers to extend the platform's functionality. The platform supports custom logic implementation, integration with external systems, and the creation of new services or modules, ensuring businesses can build unique and innovative e-commerce experiences."
    }
  ],
  "arch_description": "This is a placeholder of Spryker Architecture description.",
  "arch_image": "../../images/platforms/arch-commercetools.png",
  "benefits": [
    {
      "title": "benefit - 1",
      "description": "This is a placeholder of CommerceTools benefit 1."
    },
    {
      "title": "benefit - 2",
      "description": "This is a placeholder of CommerceTools benefit 2."
    },
    {
      "title": "benefit - 3",
      "description": "This is a placeholder of CommerceTools benefit 3."
    },
    {
      "title": "benefit - 4",
      "description": "This is a placeholder of CommerceTools benefit 4."
    }
  ],
  "why_me": [
    {
      "title": "reason - 1",
      "description": "Reson 1 why me."
    },
    {
      "title": "reason - 2",
      "description": "Reson 2 why me."
    },
    {
      "title": "reason - 3",
      "description": "Reson 3 why me."
    },
    {
      "title": "reason - 4",
      "description": "Reson 4 why me."
    }
  ]
}